Documents/ОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОприходованиеТоваров</Name>
			<Comment>Оприходование товаров</Comment>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОприходованиеТоваров/Forms/УДАЛИТЬ_ФормаПараметрыОстаткаПленки/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	ПеренестиОдинТиповойПотолок();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фактура = Параметры.Фактура;
	Цвет = Параметры.Цвет;
	//Количество = Параметры.Количество;
	Длина = Параметры.Количество;
	Организация = Параметры.Организация;
	Склад = Параметры.Склад;
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНоменклатуре(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Организация",			Организация);
	ПараметрыПодбора.Вставить("ПодборТиповых",			Истина);
	Если Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка") Тогда 
		ПараметрыПодбора.Вставить("Склад", 				ПолучитьСкладТекущегоПользователя());
	Иначе
		ПараметрыПодбора.Вставить("Склад",				Склад);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыПолотно());
	ВозвращенноеЗначение = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораНоменклатуры",ПараметрыПодбора);
	
	Если НЕ ВозвращенноеЗначение = Неопределено Тогда
		Если ВозвращенноеЗначение.Количество() = 1 Тогда
			Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
				Номенклатура = ТекущаяСтрока.Номенклатура;
				Количество = ТекущаяСтрока.Количество;
				ЗаполнитьФактуруИЦветПоНоменклатуре();
			КонецЦикла;
		Иначе	
			//если больше одного нужно заполнить ТЧ типовыми отрезами
			ПеренестиНесколькоТиповыхПотолков(ВозвращенноеЗначение);						
		КонецЕсли;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНесколькоТиповыхПотолков(ВозвращенноеЗначение)
	ТаблицаПотолков.Очистить();
	Для Каждого ТекущаяСтрока из ВозвращенноеЗначение Цикл
		НоваяСтрока = ТаблицаПотолков.Добавить();				
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;		
		НоваяСтрока.Цвет = ТекущаяСтрока.Цвет;		
		НоваяСтрока.Фактура = ТекущаяСтрока.Фактура;
	КонецЦикла;
	
	Закрыть(ТаблицаПотолков);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОдинТиповойПотолок()
	ТаблицаПотолков.Очистить();	
	НоваяСтрока = ТаблицаПотолков.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Фактура = Фактура;
	НоваяСтрока.Цвет = Цвет;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Длина = Длина;
	НоваяСтрока.Ширина = ШиринаПолотна;
	Закрыть(ТаблицаПотолков);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьФактуруИЦветПоНоменклатуре()
	
	Если Номенклатура.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦветФактуры.Ссылка,
	|	ЦветФактуры.Владелец
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветФактуры
	|ГДЕ
	|	ЦветФактуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Цвет = Выборка.Ссылка;
		Фактура = Выборка.Владелец;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладТекущегоПользователя()
	Возврат ОбщийМодульСервер.НастройкаПользователя("Склад");
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыПолотно()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);
	Возврат Список;

	
КонецФункции

&НаСервере
Процедура ФактураПриИзмененииНаСервере()
	ШиринаПолотна = Фактура.ШиринаПолотна;
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ФактураПриИзменении(Элемент)
	ФактураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчитатьПлощадь()
	
	Количество = (ШиринаПолотна * Длина) / 10000;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если НЕ ШиринаПолотна = 0 Тогда
		Длина = Количество * 10000 / ШиринаПолотна
	КонецЕсли;
КонецПроцедуры
